app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "director", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Test"], ["rating", "G"], ["director", "tt"], ["release_date", "2018-03-20 00:00:00.000000"], ["created_at", "2018-03-20 00:29:28.125833"], ["updated_at", "2018-03-20 00:29:28.125833"]]

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "title" = ?, "director" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Aladdin"], ["director", "Ron Clements"], ["release_date", "2019-11-25 00:00:00.000000"], ["updated_at", "2018-03-20 17:08:44.212611"], ["id", 1]]

  def same_director
    @movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]